#!/bin/bash

LOG_FILE="xnStatSVN.log"

# 获取需要比较的SVN版本字符串
get_revision() 
{
    FROM=$1
    TO=''
    DIFF_REV=''
    if [ '$2' == 'HEAD' ]
    then
        TO='HEAD';
        DIFF_REV=$FROM;
    else
        TO=$2;
        DIFF_REV="${FROM}:${TO}";
    fi
}

OUT=$(mktemp)
while [ -n "$1" ]; do
    case $1 in
        -a) shift

            FROM=`cat $1 | grep -v "^[ ]*#" |  grep -v "^[ ]*$" | sed -n 1p`
            TO=`cat $1 | grep -v "^[ ]*#" | grep -v "^[ ]*$" | sed -n 2p`

            echo
            echo "-------------------------------------------------------------------------------------------------------------------"
            echo "                                                  SVN 代码统计                                                     "
            echo "-------------------------------------------------------------------------------------------------------------------"
            awk 'BEGIN{ printf " %-25s %-20s %-12s %-12s %-12s %-12s \n", "项目名", "时间范围", "总行数", "修改行数", "删除行数", "新增行数"; }'
            echo "-------------------------------------------------------------------------------------------------------------------"

            for arg in `cat $1 | grep -v "^[ ]*#" | grep -v "^[ ]*$" | tail -n +3`
            do
                sh svn_stats.sh -a $FROM $TO $arg | tee -a $OUT
            done

            echo "-------------------------------------------------------------------------------------------------------------------"
            cat $OUT | awk '{ sum_code += $3; sum_mod += $4; sum_del += $5; sum_add += $6; } END{ printf " %-25s %-20s %-12s %-12s %-12s %-12s \n", "SUM", svn_date, sum_code, sum_mod, sum_del, sum_add; }' svn_date="${FROM}:${TO}"
            echo

            rm -f $OUT

            break;;

        -t) shift

            FROM=`cat $1 | grep -v "^[ ]*#" |  grep -v "^[ ]*$" | sed -n 1p`
            TO=`cat $1 | grep -v "^[ ]*#" | grep -v "^[ ]*$" | sed -n 2p`

            echo
            echo "-------------------------------------------------------------------------------------------------------------------"
            echo "                                                  SVN 代码统计                                                     "
            echo "-------------------------------------------------------------------------------------------------------------------"
            awk 'BEGIN{ printf " %-25s %-20s %-12s %-12s %-12s %-12s \n", "项目名", "时间范围", "总行数", "修改行数", "删除行数", "新增行数"; }'
            echo "-------------------------------------------------------------------------------------------------------------------"

            for arg in `cat $1 | grep -v "^[ ]*#" | grep -v "^[ ]*$" | tail -n +3`
            do
                sh svn_stats.sh -t $FROM $TO $arg | tee -a $OUT
            done

            echo "-------------------------------------------------------------------------------------------------------------------"
            cat $OUT | awk '{ sum_code += $3; sum_mod += $4; sum_del += $5; sum_add += $6; } END{ printf " %-25s %-20s %-12s %-12s %-12s %-12s \n", "SUM", svn_date, sum_code, sum_mod, sum_del, sum_add; }' svn_date="${FROM}:${TO}"
            echo

            rm -f $OUT

            break;;

        -u) shift

            FROM=`cat $1 | grep -v "^[ ]*#" |  grep -v "^[ ]*$" | sed -n 1p`
            TO=`cat $1 | grep -v "^[ ]*#" | grep -v "^[ ]*$" | sed -n 2p`

            echo 
            echo "------------------------------------------------------------------------------------------------------------------------------"
            echo "                                                SVN 代码统计 - 开发人员提交量分析                                             " 
            echo "------------------------------------------------------------------------------------------------------------------------------"
            awk 'BEGIN{ printf " %-25s %-20s %-12s %-12s %-12s %-12s %-12s \n", "项目名", "时间范围", "开发人员", "总修改行数", "修改行数", "删除行数", "新增
行数"; }'
            echo "------------------------------------------------------------------------------------------------------------------------------"

            for arg in `cat $1 | grep -v "^[ ]*#" | grep -v "^[ ]*$" | tail -n +3`
            do
                sh svn_stats.sh -u $FROM $TO $arg | tee -a $OUT
            done

            echo "-------------------------------------------------------------------------------------------------------------------"
            cat $OUT | awk '{ sum_total_mod += $4; sum_mod += $5; sum_del += $6; sum_add += $7; } END{ printf " %-25s %-20s %-12s %-12s %-12s %-12s \n", "SUM", svn_date, sum_total_mod, sum_mod, sum_del, sum_add; }' svn_date="${FROM}:${TO}"
            echo

            rm -f $OUT

            break;;

        -f) shift

            FROM=`cat $1 | grep -v "^[ ]*#" |  grep -v "^[ ]*$" | sed -n 1p`
            TO=`cat $1 | grep -v "^[ ]*#" | grep -v "^[ ]*$" | sed -n 2p`

            echo
            echo "------------------------------------------------------------------------------------------------------------------------------"
            echo "                                                 SVN 代码统计 - 文件类型分析                                                  " 
            echo "------------------------------------------------------------------------------------------------------------------------------"
            awk 'BEGIN{printf " %-25s %-20s %-12s %-12s %-12s %-12s %-12s \n", "项目名", "时间范围", "文件类型", "总修改行数", "修改行数", "删除行数", "新增>行数";}'
            echo "------------------------------------------------------------------------------------------------------------------------------"

            for arg in `cat $1 | grep -v "^[ ]*#" | grep -v "^[ ]*$" | tail -n +3`
            do
                sh svn_stats.sh -f $FROM $TO $arg | tee -a $OUT
            done

            echo "-------------------------------------------------------------------------------------------------------------------"
            cat $OUT | awk '{ sum_total_mod += $4; sum_mod += $5; sum_del += $6; sum_add += $7; } END{ printf " %-25s %-20s %-12s %-12s %-12s %-12s \n", "SUM", svn_date, sum_total_mod, sum_mod, sum_del, sum_add; }' svn_date="${FROM}:${TO}"
            echo

            rm -f $OUT

            break;;

        -h|*) shift
            echo "help"
            break;;

    esac
done

